ZeeLivermorium/PN532_TM4C123G/PN532_SSI/PN532_SSI.c
    SS_LOW();                                // start
    delay(1);                                // wake up PN532
    
    write(PN532_SPI_DATAREAD);               // tell PN532 the host about to read data
    for (int i = 0; i < 6; i++)
        ACK_buffer[i] = read();              // read ACK frame
    
    delay(1);                                // give time for the last write to finish
    SS_HIGH();                               // end
    
    return memcmp(ACK_buffer, ACK_frame, 6); // check ACK frame and return
}

/**
 *
 * data sheet page 28
 */
static void writeFrame(uint8_t *cmd, uint8_t cmd_length) {
    SS_LOW();
    delay(1);
    
    write(PN532_SPI_DATAWRITE);              // tell PN532 the host about to write data
    write(PN532_PREAMBLE);                   // write PREAMBLE
    write(PN532_STARTCODE1);                 // write first byte of START CODE
    write(PN532_STARTCODE2);                 // write second byte of START CODE
    
    cmd_length++;                            // length of data field: TFI + DATA
    write(cmd_length);                       // write command length to LEN
    write(~cmd_length + 1);                  // write the 2's complement of command length to LCS
    write(PN532_HOSTTOPN532);                // a frame from the host controller to the PN532
    
    uint8_t DCS = PN532_HOSTTOPN532;         // data checksum, see datasheet how it is used
    
    for (uint8_t i = 0; i < cmd_length - 1; i++) {
        write(cmd[i]);                       // write data byte
        DCS += cmd[i];                       // accumulate data checksum
    }
    
    write(~DCS + 1);                         // write 2's complement of DCS
    write(PN532_POSTAMBLE);                  // write POSTAMBLE
    
    delay(1);                                // give time for the last write to finish
    SS_HIGH();
}


/****************************************************
 *                                                  *
 *                     R/W API                      *
 *                                                  *
 ****************************************************/

/**
 * writeCommand
 * ----------
 *
 */
int writeCommand(uint8_t *cmd, uint8_t cmd_length) {
    command = cmd[0];                                  // record command for response verification
    writeFrame(cmd, cmd_length);                       // write command
    if (!waitToBeReadyForResponse(PN532_ACK_WAIT_TIME)) return 0;
    if (readACK()) return 0;                           // read ACK
    return 1;
}

/**
 * readResponse
 * ----------
 * page 28
 *
 */
int16_t readResponse(uint8_t *data_buffer, uint8_t data_length) {
    if (!waitToBeReadyForResponse(1000))
        return PN532_TIMEOUT;                          // return time out error code as result
    
    SS_LOW();
    delay(1);
    
    write(PN532_SPI_DATAREAD);                         // tell PN532 the host about to read data
    
    /* read 1st (byte 0) to 3rd (byte 2) bytes */
    if (read() != PN532_PREAMBLE   ||                  // first byte should be PREAMBLE
        read() != PN532_STARTCODE1 ||                  // second byte should be STARTCODE1
        read() != PN532_STARTCODE2                     // third byte should be STARTCODE2
        ) {
        SS_HIGH();                                     // pull SS high since we are exiting this function
        return PN532_INVALID_FRAME;                    // return invalid frame code as result
    }
    
    /* read 4th and 5th bytes */
    uint8_t LEN = read();                              // LEN: number of bytes in the data field
    uint8_t LCS = read();                              // LCS: Packet Length Checksum
    if ((uint8_t)(LEN + LCS) != 0x00 ) {
        SS_HIGH();                                     // pull SS high since we are exiting this function
        return PN532_INVALID_FRAME;                    // return invalid frame code as result
    }
    
    /* read 6th and 7th bytes */
    uint8_t PD0 = command + 1;                         // PD0 is command code
    if (PN532_PN532TOHOST != read() || PD0 != read()) {
        SS_HIGH();                                     // pull SS high since we are exiting this function
        return PN532_INVALID_FRAME;                    // return invalid frame code as result
    }
    
    /* check buffer size before read actual data */
    LEN -= 2;                                          // subtract TFI and PD0(command) from DATA length
    if (LEN > data_length) {                           // if no enough space, dump bytes for synchronization
        for (uint8_t i = 0; i < LEN; i++) read();      // dump data
        read();                                        // dump DCS
        read();                                        // dump POSTAMBLE
        SS_HIGH();                                     // pull SS high since we are exiting this function
        return PN532_NO_SPACE;                         // return (buffer) no space error code as result
    }
    
    /* read actual data */
    uint8_t SUM = PN532_PN532TOHOST + PD0;             // SUM: TFI + DATA, DATA = PD0 + PD1 + ... + PDn
    for (uint8_t i = 0; i < LEN; i++) {
        data_buffer[i] = read();                       // get data
        SUM += data_buffer[i];                         // accumulate SUM
    }
    
    /* read data checksum byte */
    uint8_t DCS = read();
    if ((uint8_t)(SUM + DCS) != 0) {
        SS_HIGH();                                     // pull SS high since we are exiting this function
        return PN532_INVALID_FRAME;                    // proper frame should result in SUM + DCS = 0
    }
    
    /* read POSTAMBLE */
    read();                                            // dump for synchronization
    
    delay(1);                                          // give time for the last write to finish
    SS_HIGH();
    
    return LEN;
}


#endif
